tutorials/conjugateHeatTransfer/coolingSphere/rhoPimpleFluid/system/coupledSolutionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      coupledSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

couplingMethod          partitioned;

partitioned
{
    coupleRelaxFactor		0.5;
    relConvergeTolerance	1e-05;
    maxCoupleIter			100;
}


// ************************************************************************* //
